<!-- slide -->
<div class="slide">
<h1>非干渉とは</h1>
<div class="incremental">
<h2>AS（アクセシビリティ サポーテッド）でない / 適合しない技術で作られている場合と、4つの特別な達成基準</h2>
<div>
<ul>
	<li><strong>ブラウザと支援技術の利用を阻害し、まったくコンテンツを利用できなくなる危険性のある実装を禁じる適合要件</strong></li>
	<li>ASでない、適合しない技術によって、他の情報へのアクセスが阻害されないようにする</li>
	<li><strong>依存していない技術</strong>は、適合要件を阻害しない</li>
	<li><strong>4つの特別な達成基準</strong>があり、この中には、事前の知識がないと、さらっと実装してしまうことがあるので注意が必要</li>
</ul>
</div>

<div>
<h3>AS（アクセシビリティ サポーテッド）</h3>
<p>支援技術やブラウザで<strong>実際に使える技術</strong>を「ASな技術」という。一般的なブラウザと支援技術の組み合わせで、技術仕様が求める通りの動作をする技術（HTML / CSS / JavaScript）であれば、概ね「実際に使える」と言えるが、ブラウザや支援技術が仕様に追いついていないことがあるので要注意。</p>
<h3>依存していない技術/ASでない技術</h3>
<p>ウェブアクセシビリティは、ブラウザや支援技術、HTML、CSS、JavaScriptなどに<strong>依存して</strong>実現されている（依存しない手法もあり得る）。想像しづらいが、これ以外の技術（先端的な技術や廃れた技術）で構築したコンテンツが、ブラウザや支援技術の操作を阻害することがある。</p>
</div>

</div>
</div>
